

// Snapshot Testing ----------------------------------------------------------------------------------------------------------------







// Snapshot Testing with Jest ----------------------------------------------------------------------------------------------------------------
// 在测试React组件时，也可以采用类似的方法。 你可以使用一个测试渲染器来快速地为你的React树生成一个可序列化的值，而不是渲染图形UI，这需要构建整个应用程序。 考虑下面这个Link组件的测试示例:  

// import React from 'react';
// import renderer from 'react-test-renderer';
// import { Link } from './components/Link';

// it('renders correctly', () => {
//   const tree = renderer
//     .create(<Link page="http://www.facebook.com">Facebook</Link>)
//     .toJSON();
//   expect(tree).toMatchSnapshot();
// });









// Mock Functions ----------------------------------------------------------------------------------------------------------------













// Mock Functions ----------------------------------------------------------------------------------------------------------------











// Mock Functions ----------------------------------------------------------------------------------------------------------------















// Mock Functions ----------------------------------------------------------------------------------------------------------------













// Mock Functions ----------------------------------------------------------------------------------------------------------------











// Mock Functions ----------------------------------------------------------------------------------------------------------------












// 'usingMatchers.test.tsx'不能在'——isolatedModules'下编译，因为它被认为是一个全局脚本文件。添加import、export或空的'export{}'语句使其成为模块。  
export {}


