


import React from 'react';
import { render, screen } from '@testing-library/react';

import { MyCom } from './components/RtlCourse';


// https://github.com/testing-library/react-testing-library#docs
// React Testing Library  简单而完整的React DOM测试工具，鼓励良好的测试实践。  


// The problem  问题提出 ------------------------------------------------------------------------------------------------------------------------------
// 你想为React组件编写可维护的测试。作为此目标的一部分，您希望您的测试避免包含组件的实现细节，而将重点放在使您的测试给您带来预期的信心上。 
// 作为其中的一部分，您希望您的测试库在长期运行中是可维护的，这样您的组件的重构(对实现的更改而不是功能的更改)就不会破坏您的测试，并降低您和您的团队的速度。  


// The solution  解决方案 ------------------------------------------------------------------------------------------------------------------------------
// React测试库是一个测试React组件的轻量级解决方案。 它在react-dom和react-dom/test-utils之上提供了简单的实用函数，以鼓励更好的测试实践。 
// 它的主要指导原则是:  你的测试越像你的软件的使用方式，你就越有信心。 


// Basic Example ------------------------------------------------------------------------------------------------------------------------------



















// 问题提出 ------------------------------------------------------------------------------------------------------------------------------









// 问题提出 ------------------------------------------------------------------------------------------------------------------------------










// 问题提出 ------------------------------------------------------------------------------------------------------------------------------









// 问题提出 ------------------------------------------------------------------------------------------------------------------------------









// 问题提出 ------------------------------------------------------------------------------------------------------------------------------























































